package com.yiyun.entity.system;

public class VideoFlashMp4 {
	/*var flashvars={
		      f:'http://movie.ks.js.cn/flv/2011/11/8-1.flv',//视频地址
		      a:'',//调用时的参数，只有当s>0的时候有效
		      s:'0',//调用方式，0=普通方法（f=视频地址），1=网址形式,2=xml形式，3=swf形式(s>0时f=网址，配合a来完成对地址的组装)
		      c:'0',//是否读取文本配置,0不是，1是
		      x:'',//调用xml风格路径，为空的话将使用ckplayer.js的配置
		      i:'',//初始图片地址
		      d:'http://www.ckplayer.com/temp/11.jpg',//暂停时播放的广告，swf/图片
		      u:'http://www.baidu.com',//暂停时如果是图片的话，加个链接地址
		      l:'http://www.ckplayer.com/down/start.swf',//视频开始前播放的广告，swf/图片/视频
		      r:'',//视频开始前播放图片/视频时加一个链接地址
		      t:'1',//视频开始前播放swf/图片时的时间
		      e:'3',//视频结束后的动作，0是调用js函数，1是循环播放，2是暂停播放，3是调用视频推荐列表的插件
		      v:'85',//默认音量，0-100之间
		      p:'1',//视频默认0是暂停，1是播放
		      h:'1',//播放http视频流时采用何种拖动方法，0是按关键帧，1是按关键时间点
		      q:'',//视频流拖动时参考函数，默认是start
		      m:'0',//默认是否采用点击播放按钮后再加载视频，0不是，1是,设置成1时不要有前置广告
		      g:'',//视频直接g秒开始播放
		      j:'',//视频提前j秒结束
		      k:'10|40|80',//提示点时间，如 30|60鼠标经过进度栏30秒，60秒会提示n指定的相应的文字
		      n:'跳过开头|小企鹅宝宝下水了|跳过结尾',//提示点文字，跟k配合使用，如 提示点1|提示点2
		      b:'0x000',//播放器的背景色，如果不设置的话将默认透明
		      w:'',//指定调用自己配置的文本文件,不指定将默认调用和播放器同名的txt文件
		      //调用播放器的所有参数列表结束
		      //以下为自定义的播放器参数用来在插件里引用的
		      my_title:'视频标题',//视频标题
		      my_url:'http://www.ckplayer.com/index.php',//本页面地址
		      my_summary:'这是一个测试页面',//视频介绍，请保持在一行文字，不要换行
		      my_pic:'http://www.ckplayer.com/temp/11.jpg'//分享的图片地址
		      //调用自定义播放器参数结束
		};*/
	
	private String f="";//视频地址
	private String a="";//调用时的参数，只有当s>0的时候有效
	
}
